#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Sublime/tfc-example-staging/runs/run-TDBcnTyJg5nU3MFx

Waiting for the plan to start...

Terraform v0.12.30
Configuring remote state backend...
Initializing Terraform configuration...
2021/02/26 17:45:33 [DEBUG] Using modified User-Agent: Terraform/0.12.30 TFC/c2de94f1fb
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

random_pet.table_name: Refreshing state... [id=flying-coyote]
aws_dynamodb_table.tfc_example_table: Refreshing state... [id=ype-dev-flying-coyote]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.tfc_example_table must be replaced
-/+ resource "aws_dynamodb_table" "tfc_example_table" {
      ~ arn              = "arn:aws:dynamodb:eu-west-1:920543715711:table/ype-dev-flying-coyote" -> (known after apply)
        billing_mode     = "PROVISIONED"
        hash_key         = "UUID"
      ~ id               = "ype-dev-flying-coyote" -> (known after apply)
      ~ name             = "ype-dev-flying-coyote" -> "aaa-dev-flying-coyote" # forces replacement
        read_capacity    = 1
      + stream_arn       = (known after apply)
      - stream_enabled   = false -> null
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      - tags             = {} -> null
        write_capacity   = 1

        attribute {
            name = "UUID"
            type = "S"
        }

      ~ point_in_time_recovery {
          ~ enabled = false -> (known after apply)
        }

      + server_side_encryption {
          + enabled = (known after apply)
        }

      - ttl {
          - enabled = false -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>

*Pusher: @SublimeYohan, Action: `pull_request`*